---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\02_Code\LOG_File_Paper.log
  log type:  text
 opened on:  30 Oct 2023, 18:05:58
r; t=0.00 18:05:58

. 
. * -----------------------------------------------------------------------------*        
. * 2 Preparation of NFL Data *
. 
. * 2.1 Exclusion if Pathway Games
. *QBs of Home-Team
. drop if (Date == mdy(10, 31, 2010) & inlist(Team, "San Francisco")) ///
>        | (Date == mdy(09, 07, 2010) & inlist(Team, "Chicago")) ///
>        | (Date == mdy(10, 23, 2011) & inlist(Team, "Chicago")) ///
>        | (Date == mdy(10, 30, 2011) & inlist(Team, "Buffalo")) ///
>        | (Date == mdy(10, 28, 2012) & inlist(Team, "New England")) ///
>        | (Date == mdy(12, 16, 2012) & inlist(Team, "Seattle")) ///
>        | (Date == mdy(09, 29, 2013) & inlist(Team, "Minnesota")) ///
>        | (Date == mdy(10, 27, 2013) & inlist(Team, "San Francisco")) ///
>        | (Date == mdy(12, 01, 2013) & inlist(Team, "Atlanta")) ///
>        | (Date == mdy(09, 28, 2014) & inlist(Team, "Miami")) ///
>        | (Date == mdy(10, 26, 2014) & inlist(Team, "Detroit")) ///
>        | (Date == mdy(11, 09, 2014) & inlist(Team, "Dallas")) ///
>        | (Date == mdy(10, 04, 2015) & inlist(Team, "New York")) ///
>        | (Date == mdy(10, 25, 2015) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(11, 01, 2015) & inlist(Team, "Kansas")) ///
>        | (Date == mdy(10, 02, 2016) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(10, 23, 2016) & inlist(Team, "New York")) ///
>        | (Date == mdy(10, 30, 2016) & inlist(Team, "Washington")) ///
>        | (Date == mdy(11, 21, 2016) & inlist(Team, "Oakland")) ///
>        | (Date == mdy(09, 24, 2017) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(10, 01, 2017) & inlist(Team, "New Orleans")) ///
>        | (Date == mdy(10, 22, 2017) & inlist(Team, "Los Angeles")) ///
>        | (Date == mdy(10, 29, 2017) & inlist(Team, "Minnesota")) ///
>        | (Date == mdy(11, 19, 2017) & inlist(Team, "New England")) ///
>        | (Date == mdy(10, 14, 2018) & inlist(Team, "Seattle")) ///
>        | (Date == mdy(10, 21, 2018) & inlist(Team, "Los Angeles")) ///
>        | (Date == mdy(10, 28, 2018) & inlist(Team, "Philadelphia")) ///
>        | (Date == mdy(11, 19, 2018) & inlist(Team, "Los Angeles")) ///
>        | (Date == mdy(08, 13, 2019) & inlist(Team, "Oakland")) ///
>        | (Date == mdy(10, 06, 2019) & inlist(Team, "Oakland")) ///
>        | (Date == mdy(10, 13, 2019) & inlist(Team, "Carolina")) ///
>        | (Date == mdy(10, 27, 2019) & inlist(Team, "Cincinnati")) ///
>        | (Date == mdy(11, 03, 2019) & inlist(Team, "Houston")) ///
>        | (Date == mdy(11, 18, 2019) & inlist(Team, "Kansas")) ///
>        | (Date == mdy(10, 10, 2021) & inlist(Team, "Atlanta")) ///
>        | (Date == mdy(10, 17, 2021) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(10, 02, 2022) & inlist(Team, "Minnesota")) ///
>        | (Date == mdy(10, 09, 2022) & inlist(Team, "New York")) ///
>        | (Date == mdy(10, 30, 2022) & inlist(Team, "Denver")) ///
>        | (Date == mdy(11, 13, 2022) & inlist(Team, "Tampa Bay")) ///
>        | (Date == mdy(11, 21, 2022) & inlist(Team, "San Francisco")) ///
>        | (Date == mdy(10, 01, 2023) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(10, 08, 2023) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(10, 15, 2023) & inlist(Team, "Baltimore"))
(35 observations deleted)
r; t=0.03 18:05:58

. 
. 
. *QBs of Away-Team
. drop if (Date == mdy(10, 31, 2010) & inlist(Team, "Denver")) ///
>        | (Date == mdy(09, 07, 2010) & inlist(Team, "Buffalo")) ///
>        | (Date == mdy(10, 23, 2011) & inlist(Team, "Tampa Bay")) ///
>        | (Date == mdy(10, 30, 2011) & inlist(Team, "Washington")) ///
>        | (Date == mdy(10, 28, 2012) & inlist(Team, "St. Louis")) ///
>        | (Date == mdy(12, 16, 2012) & inlist(Team, "Buffalo")) ///
>        | (Date == mdy(09, 29, 2013) & inlist(Team, "Pittsburgh")) ///
>        | (Date == mdy(10, 27, 2013) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(12, 01, 2013) & inlist(Team, "Buffalo")) ///
>        | (Date == mdy(09, 28, 2014) & inlist(Team, "Oakland")) ///
>        | (Date == mdy(10, 26, 2014) & inlist(Team, "Atlanta")) ///
>        | (Date == mdy(11, 09, 2014) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(10, 04, 2015) & inlist(Team, "Miami")) ///
>        | (Date == mdy(10, 25, 2015) & inlist(Team, "Buffalo")) ///
>        | (Date == mdy(11, 01, 2015) & inlist(Team, "Detroit")) ///
>        | (Date == mdy(10, 02, 2016) & inlist(Team, "Indianapolis")) ///
>        | (Date == mdy(10, 23, 2016) & inlist(Team, "Los Angeles")) ///
>        | (Date == mdy(10, 30, 2016) & inlist(Team, "Cincinnati")) ///
>        | (Date == mdy(11, 21, 2016) & inlist(Team, "Houston")) ///
>        | (Date == mdy(09, 24, 2017) & inlist(Team, "Baltimore")) ///
>        | (Date == mdy(10, 01, 2017) & inlist(Team, "Miami")) ///
>        | (Date == mdy(10, 22, 2017) & inlist(Team, "Arizona")) ///
>        | (Date == mdy(10, 29, 2017) & inlist(Team, "Cleveland")) ///
>        | (Date == mdy(11, 19, 2017) & inlist(Team, "Oakland")) ///
>        | (Date == mdy(10, 14, 2018) & inlist(Team, "Oakland")) ///
>        | (Date == mdy(10, 21, 2018) & inlist(Team, "Tennessee")) ///
>        | (Date == mdy(10, 28, 2018) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(11, 19, 2018) & inlist(Team, "Kansas")) ///
>        | (Date == mdy(08, 13, 2019) & inlist(Team, "Green Bay")) ///
>        | (Date == mdy(10, 06, 2019) & inlist(Team, "Chicago")) ///
>        | (Date == mdy(10, 13, 2019) & inlist(Team, "Tampa Bay")) ///
>        | (Date == mdy(10, 27, 2019) & inlist(Team, "Los Angeles")) ///
>        | (Date == mdy(11, 03, 2019) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(11, 18, 2019) & inlist(Team, "Los Angeles (Chargers)")) ///
>        | (Date == mdy(10, 10, 2021) & inlist(Team, "New York (Jets)")) ///
>        | (Date == mdy(10, 17, 2021) & inlist(Team, "Miami")) ///
>        | (Date == mdy(10, 02, 2022) & inlist(Team, "New Orleans")) ///
>        | (Date == mdy(10, 09, 2022) & inlist(Team, "Green Bay")) ///
>        | (Date == mdy(10, 30, 2022) & inlist(Team, "Jacksonville")) ///
>        | (Date == mdy(11, 13, 2022) & inlist(Team, "Seattle")) ///
>        | (Date == mdy(11, 21, 2022) & inlist(Team, "Arizona")) ///
>        | (Date == mdy(10, 01, 2023) & inlist(Team, "Atlanta")) ///
>        | (Date == mdy(10, 08, 2023) & inlist(Team, "Buffalo")) ///
>        | (Date == mdy(10, 15, 2023) & inlist(Team, "Tennessee"))
(42 observations deleted)
r; t=0.03 18:05:58

. 
. *2.2 Stadion
. * Attach Stadion to Place - which is right now only in Team Location
. gen Stadion = ""
(7,290 missing values generated)
r; t=0.00 18:05:58

. replace Stadion = "State Farm Stadium" if inlist(Place, "Arizona")
variable Stadion was str1 now str18
(229 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Mercedes-Benz Stadium" if inlist(Place, "Atlanta")
variable Stadion was str18 now str21
(232 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "M&T Bank Stadium" if inlist(Place, "Baltimore")
(221 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Highmark Stadium" if inlist(Place, "Buffalo")
(221 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Bank of America Stadium" if inlist(Place, "Carolina")
variable Stadion was str21 now str23
(230 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Soldier Field" if inlist(Place, "Chicago")
(233 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Paul Brown Stadium" if inlist(Place, "Cincinatti")
(230 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "FirstEnergy Stadium" if inlist(Place, "Cleveland")
(231 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "AT&T Stadium" if inlist(Place, "Dallas")
(229 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Empower Field at Mile High" if inlist(Place, "Denver")
variable Stadion was str23 now str26
(236 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Ford Field" if inlist(Place, "Detroit")
(228 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Lambeau Field" if inlist(Place, "Green Bay")
(224 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "NRG Stadium" if inlist(Place, "Houston")
(232 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Lucas Oil Stadium" if inlist(Place, "Indianapolis")
(232 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "TIAA Bank Field" if inlist(Place, "Jacksonville")
(212 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Arrowhead Stadium" if inlist(Place, "Kansas")
(221 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Allegiant Stadium" if inlist(Place, "Las Vegas")
(59 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "SoFi Stadium" if inlist(Place, "Los Angeles (Chargers)") ///
> | inlist(Place, "Los Angeles (Rams)")
(229 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Hard Rock Stadium" if inlist(Place, "Miami")
(234 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "U.S. Bank Stadium" if inlist(Place, "Minnesota")
(232 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Gillette Stadium" if inlist(Place, "New England")
(232 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Caesars Superdome" if inlist(Place, "New Orleans")
(224 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "MetLife Stadium" if inlist(Place, "New York (Giants)") ///
> | inlist(Place, "New York (Jets)")
(461 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Lincoln Financial Field" if inlist(Place, "Philadelphia")
(228 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Heinz Field" if inlist(Place, "Pittsburgh")
(232 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Levi's Stadium" if inlist(Place, "San Francisco")
(228 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Lumen Field" if inlist(Place, "Seattle")
(227 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Raymond James Stadium" if inlist(Place, "Tampa Bay")
(214 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Nissan Stadium" if inlist(Place, "Tennesse")
(234 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "FedExField" if inlist(Place, "Washington")
(233 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Edward Jones Dome" if inlist(Place, "St. Louis")
(102 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "Qualcomm Stadium" if inlist(Place, "San Diego")
(116 real changes made)
r; t=0.00 18:05:58

. replace Stadion = "O.co Coliseum" if inlist(Place, "Oakland")
(164 real changes made)
r; t=0.00 18:05:58

. 
. * Switch to the actual place of the Stadion
. gen Place_2 = ""
(7,290 missing values generated)
r; t=0.00 18:05:58

. replace Place_2 = "Glendale, Arizona" if Stadion == "State Farm Stadium"
variable Place_2 was str1 now str17
(229 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Atlanta, Georgia" if Stadion == "Mercedes-Benz Stadium"
(232 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Baltimore, Maryland" if Stadion == "M&T Bank Stadium"
variable Place_2 was str17 now str19
(221 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Orchard Park, New York" if Stadion == "Highmark Stadium"
variable Place_2 was str19 now str22
(221 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Charlotte, North Carolina" ///
> if Stadion == "Bank of America Stadium"
variable Place_2 was str22 now str25
(230 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Chicago, Illinois" if Stadion == "Soldier Field"
(233 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Cincinnati, Ohio" if Stadion == "Paul Brown Stadium"
(230 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Cleveland, Ohio" if Stadion == "FirstEnergy Stadium"
(231 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Arlington, Texas" if Stadion == "AT&T Stadium"
(229 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Denver, Colorado" if Stadion == "Empower Field at Mile High"
(236 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Detroit, Michigan" if Stadion == "Ford Field"
(228 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Green Bay, Wisconsin" if Stadion == "Lambeau Field"
(224 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Houston, Texas" if Stadion == "NRG Stadium"
(232 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Indianapolis, Indiana" if Stadion == "Lucas Oil Stadium"
(232 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Jacksonville, Florida" if Stadion == "TIAA Bank Field"
(212 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Kansas City, Missouri" if Stadion == "Arrowhead Stadium"
(221 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Paradise, Nevada" if Stadion == "Allegiant Stadium"
(59 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Inglewood, California" if Stadion == "SoFi Stadium"
(229 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Miami Gardens, Florida" if Stadion == "Hard Rock Stadium"
(234 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Minneapolis, Minnesota" if Stadion == "U.S. Bank Stadium"
(232 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Foxborough, Massachusetts" if Stadion == "Gillette Stadium"
(232 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "New Orleans, Louisiana" if Stadion == "Caesars Superdome"
(224 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "East Rutherford, New Jersey" if Stadion == "MetLife Stadium"
variable Place_2 was str25 now str27
(461 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Philadelphia, Pennsylvania" if Stadion == "Lincoln Financial Field"
(228 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Pittsburgh, Pennsylvania" if Stadion == "Heinz Field"
(232 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Santa Clara, California" if Stadion == "Levi's Stadium"
(228 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Seattle, Washington" if Stadion == "Lumen Field"
(227 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Tampa, Florida" if Stadion == "Raymond James Stadium"
(214 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Nashville, Tennessee" if Stadion == "Nissan Stadium"
(234 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Landover, Maryland" if Stadion == "FedExField"
(233 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "St Louis, Missouri" if Stadion == "Edward Jones Dome"
(102 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "San Diego, California" if Stadion == "Qualcomm Stadium"
(116 real changes made)
r; t=0.00 18:05:58

. replace Place_2 = "Oakland, California" if Stadion == "O.co Coliseum"
(164 real changes made)
r; t=0.00 18:05:58

. drop Place
r; t=0.00 18:05:58

. rename Place_2 Place
r; t=0.03 18:05:58

. 
. ** Insert Info on Rooftype
. gen Stadiontype = ""
(7,290 missing values generated)
r; t=0.00 18:05:58

. 
. replace Stadiontype = "Retractable" if Stadion == "AT&T Stadium" ///
>                                                                         | Stadion == "Hard Rock Stadium" ///
>                                                                         | Stadion == "Lucas Oil Stadium" ///
>                                                                         | Stadion == "Lumen Field" ///
>                                                                         | Stadion == "Mercedes-Benz Stadium" ///
>                                                                         | Stadion == "SoFi Stadium" ///
>                                                                         | Stadion == "State Farm Stadium" ///   
>                                                                         | Stadion == "NRG Stadium" 
variable Stadiontype was str1 now str11
(1,844 real changes made)
r; t=0.00 18:05:58

. 
. replace Stadiontype = "Fixed" if Stadion == "Allegiant Stadium" ///
>                                                         | Stadion == "Bank of America Stadium" ///
>                                                         | Stadion == "Caesars Superdome" ///
>                                                         | Stadion == "Edward Jones Dome" ///
>                                                         | Stadion == "Ford Field" ///
>                                                         | Stadion == "MetLife Stadium" ///
>                                                         | Stadion == "Raymond James Stadium" 
(1,518 real changes made)
r; t=0.00 18:05:58

. 
. replace Stadiontype = "Open" if Stadion == "Arrowhead Stadium" ///
>                                                         | Stadion == "Empower Field at Mile High"  ///
>                                                         | Stadion == "FedExField" ///
>                                                         | Stadion == "FirstEnergy Stadium" ///
>                                                         | Stadion == "Gillette Stadium" ///
>                                                         | Stadion == "Heinz Field" ///
>                                                         | Stadion == "Highmark Stadium" ///
>                                                         | Stadion == "Lambeau Field" ///
>                                                         | Stadion == "Levi's Stadium" ///
>                                                         | Stadion == "Lincoln Financial Field" ///
>                                                         | Stadion == "M&T Bank Stadium" ///
>                                                         | Stadion == "Nissan Stadium" ///
>                                                         | Stadion == "Paul Brown Stadium" ///
>                                                         | Stadion == "Soldier Field" ///
>                                                         | Stadion == "TIAA Bank Field" ///
>                                                         | Stadion == "U.S. Bank Stadium" ///
>                                                         | Stadion == "Qualcomm Stadium" ///
>                                                         | Stadion == "O.co Coliseum"
(3,928 real changes made)
r; t=0.01 18:05:58

. 
. * 2.3 Prepartion for Merge -> Creation of Matching Var with Filenames
. split Place, parse(",") gen(Place_Merge)                                                                                // split in two vars with , as seperator
variables created as string: 
Place_Merge1  Place_Merge2
r; t=0.02 18:05:58

. gen Place_Merge = subinstr(Place_Merge1, " ", "", .)                                                    // drop blankets -> San Francisco => SanFrancisco
r; t=0.00 18:05:58

. drop Place_Merge1 Place_Merge2                          
r; t=0.00 18:05:58

. 
. 
. format Date %td                                 
r; t=0.00 18:05:58

. gen DateStr = string(Date)
r; t=0.00 18:05:58

. gen Place_Date_Merge = Place_Merge + "_" + DateStr                                                              // create unifier based on place + date to merge m:1 
r; t=0.00 18:05:58

. drop Place_Merge DateStr
r; t=0.00 18:05:58

. 
. save "$data\Full.dta", replace
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\Full.dta saved
r; t=0.01 18:05:58

. 
. * -----------------------------------------------------------------------------*                        
. * 3 Preparation of Pollution Data *
. 
. * 3.1 PM10 Data Preperation
. local string_list "Atlanta Arlington Atlanta Baltimore Charlotte Chicago Cincinnati Cleveland Denver Detroit EastRutherford Foxborough Glendale GreenBay Houston Indianapolis Inglewood Jacksonville KansasCity Landover MiamiGardens Minneapolis Nashville N
> ewOrleans Oakland OrchardPark Paradise Philadelphia Pittsburgh SanDiego SantaClara Seattle StLouis Tampa" 
r; t=0.00 18:05:58

. 
. foreach str in `string_list' {  
  2.         import delimited "$data\PM10\PM10_`str'.csv", clear
  3.         drop sitename siteid source mainpollutant                                                                       // drop unnecessary
  4.         rename pm10aqivalue pm10                                                                                                        
  5.         gen Date = date(date, "MDY")
  6.         format Date %td 
  7.         drop date
  8.         tset Date                                                                                                                                       
  9.         tsfill                                                                                                                                          // fill TS with missing dates
 10.         count if missing(pm10)
 11.         ipolate pm10 Date, gen(pm10_ipol)                                                                                       // linear interpolation of missings (kind of debatable; could be changed to ARIMA or similar)
 12.         drop pm10 
 13.         gen pm10 = round(pm10_ipol, 1)                                                                                          // round to integers (not needed, also debatable, just a harmonization to AQI Index - also only an integer)
 14.         drop pm10_ipol
 15.         generate Name = "`str'"
 16.         gen DateStr = string(Date)
 17.         gen Place_Date_Merge = Name + "_" + DateStr                                                                     // create unifier based on place + date to merge m:1 
 18.         drop Name DateStr Date
 19.         save "$data\PM10\PM10_`str'.dta", replace
 20. }
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,834 obs)

Time variable: Date, 01jan2010 to 27oct2023, but with gaps
        Delta: 1 day
  214
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Atlanta.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 947 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  4,102
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Arlington.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,834 obs)

Time variable: Date, 01jan2010 to 27oct2023, but with gaps
        Delta: 1 day
  214
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Atlanta.dta saved
(encoding automatically selected: ISO-8859-2)
(6 vars, 893 obs)

Time variable: Date, 02jan2010 to 29jun2023, but with gaps
        Delta: 1 day
  4,034
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Baltimore.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 3,279 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  1,770
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Charlotte.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,050 obs)

Time variable: Date, 01jan2010 to 29oct2023
        Delta: 1 day
  0
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Chicago.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,851 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  199
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Cincinnati.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,047 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  3
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Cleveland.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,037 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  13
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Denver.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,980 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  70
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Detroit.dta saved
(encoding automatically selected: ISO-8859-2)
(6 vars, 1,290 obs)

Time variable: Date, 02jan2010 to 29jun2023, but with gaps
        Delta: 1 day
  3,637
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_EastRutherford.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 3,852 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  1,197
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Foxborough.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,050 obs)

Time variable: Date, 01jan2010 to 29oct2023
        Delta: 1 day
  0
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Glendale.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,700 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  349
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_GreenBay.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 1,781 obs)

Time variable: Date, 02jan2010 to 30jun2023, but with gaps
        Delta: 1 day
  3,147
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Houston.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,754 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  295
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Indianapolis.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,050 obs)

Time variable: Date, 01jan2010 to 29oct2023
        Delta: 1 day
  0
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Inglewood.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,202 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  848
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Jacksonville.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,054 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  995
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_KansasCity.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,250 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  799
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Landover.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,666 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  383
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_MiamiGardens.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,001 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  49
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Minneapolis.dta saved
(encoding automatically selected: ISO-8859-2)
(6 vars, 2,511 obs)

Time variable: Date, 02jan2010 to 30jun2023, but with gaps
        Delta: 1 day
  2,417
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Nashville.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,987 obs)

Time variable: Date, 01jan2010 to 30sep2023, but with gaps
        Delta: 1 day
  34
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_NewOrleans.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 810 obs)

Time variable: Date, 02jan2010 to 31dec2022, but with gaps
        Delta: 1 day
  3,937
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Oakland.dta saved
(encoding automatically selected: ISO-8859-2)
(6 vars, 1,290 obs)

Time variable: Date, 02jan2010 to 29jun2023, but with gaps
        Delta: 1 day
  3,637
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_OrchardPark.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,048 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  2
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Paradise.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,255 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  795
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Philadelphia.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,981 obs)

Time variable: Date, 01jan2010 to 28aug2023, but with gaps
        Delta: 1 day
  7
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Pittsburgh.dta saved
(encoding automatically selected: ISO-8859-2)
(6 vars, 2,003 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  3,047
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_SanDiego.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 4,662 obs)

Time variable: Date, 02jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  387
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_SantaClara.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 1,619 obs)

Time variable: Date, 02jan2010 to 29jun2023, but with gaps
        Delta: 1 day
  3,308
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Seattle.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,050 obs)

Time variable: Date, 01jan2010 to 29oct2023
        Delta: 1 day
  0
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_StLouis.dta saved
(encoding automatically selected: ISO-8859-1)
(6 vars, 5,001 obs)

Time variable: Date, 01jan2010 to 29oct2023, but with gaps
        Delta: 1 day
  49
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\01_Data\PM10\PM10_Tampa.dta saved
r; t=2.38 18:06:00

. 
. * -----------------------------------------------------------------------------*        
. * 4 Merge and, hence, Creation of Final Data Set *
. 
. * 4.1 PM10 
. use "$data\Full.dta", clear
r; t=0.00 18:06:00

. gen PM10 =. 
(7,290 missing values generated)
r; t=0.00 18:06:00

. 
. local string_list "Atlanta Arlington Atlanta Baltimore Charlotte Chicago Cincinnati Cleveland Denver Detroit EastRutherford Foxborough Glendale GreenBay Houston Indianapolis Inglewood Jacksonville KansasCity Landover MiamiGardens Minneapolis Nashville N
> ewOrleans Oakland OrchardPark Paradise Philadelphia Pittsburgh SanDiego SantaClara Seattle StLouis Tampa" 
r; t=0.00 18:06:00

. 
. foreach str in `string_list' {
  2.         merge m:1 Place_Date_Merge using "$data\PM10\PM10_`str'" 
  3.         replace PM10 = pm10 if !missing(pm10)
  4.         drop if _merge == 2
  5.         drop _merge pm10
  6. }

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,999
        from master                     7,058  (_merge==1)
        from using                      4,941  (_merge==2)

    Matched                               232  (_merge==3)
    -----------------------------------------
(5,173 real changes made)
(4,941 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,003
        from master                     7,061  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               229  (_merge==3)
    -----------------------------------------
(5,171 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,999
        from master                     7,058  (_merge==1)
        from using                      4,941  (_merge==2)

    Matched                               232  (_merge==3)
    -----------------------------------------
(4,941 real changes made)
(4,941 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,895
        from master                     7,073  (_merge==1)
        from using                      4,822  (_merge==2)

    Matched                               217  (_merge==3)
    -----------------------------------------
(5,039 real changes made)
(4,822 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,002
        from master                     7,060  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               230  (_merge==3)
    -----------------------------------------
(5,172 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,999
        from master                     7,057  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               233  (_merge==3)
    -----------------------------------------
(5,175 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,003
        from master                     7,060  (_merge==1)
        from using                      4,943  (_merge==2)

    Matched                               230  (_merge==3)
    -----------------------------------------
(5,173 real changes made)
(4,943 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,001
        from master                     7,059  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               231  (_merge==3)
    -----------------------------------------
(5,173 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,996
        from master                     7,054  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               236  (_merge==3)
    -----------------------------------------
(5,178 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,004
        from master                     7,062  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               228  (_merge==3)
    -----------------------------------------
(5,170 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,559
        from master                     6,842  (_merge==1)
        from using                      4,717  (_merge==2)

    Matched                               448  (_merge==3)
    -----------------------------------------
(5,165 real changes made)
(4,717 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,999
        from master                     7,058  (_merge==1)
        from using                      4,941  (_merge==2)

    Matched                               232  (_merge==3)
    -----------------------------------------
(5,173 real changes made)
(4,941 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,004
        from master                     7,061  (_merge==1)
        from using                      4,943  (_merge==2)

    Matched                               229  (_merge==3)
    -----------------------------------------
(5,172 real changes made)
(4,943 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,008
        from master                     7,066  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               224  (_merge==3)
    -----------------------------------------
(5,166 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,889
        from master                     7,066  (_merge==1)
        from using                      4,823  (_merge==2)

    Matched                               224  (_merge==3)
    -----------------------------------------
(5,047 real changes made)
(4,823 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,999
        from master                     7,058  (_merge==1)
        from using                      4,941  (_merge==2)

    Matched                               232  (_merge==3)
    -----------------------------------------
(5,173 real changes made)
(4,941 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,005
        from master                     7,061  (_merge==1)
        from using                      4,944  (_merge==2)

    Matched                               229  (_merge==3)
    -----------------------------------------
(5,173 real changes made)
(4,944 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,029
        from master                     7,078  (_merge==1)
        from using                      4,951  (_merge==2)

    Matched                               212  (_merge==3)
    -----------------------------------------
(5,163 real changes made)
(4,951 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,011
        from master                     7,069  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               221  (_merge==3)
    -----------------------------------------
(5,163 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,998
        from master                     7,057  (_merge==1)
        from using                      4,941  (_merge==2)

    Matched                               233  (_merge==3)
    -----------------------------------------
(5,174 real changes made)
(4,941 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,998
        from master                     7,056  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               234  (_merge==3)
    -----------------------------------------
(5,176 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,001
        from master                     7,058  (_merge==1)
        from using                      4,943  (_merge==2)

    Matched                               232  (_merge==3)
    -----------------------------------------
(5,175 real changes made)
(4,943 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,885
        from master                     7,062  (_merge==1)
        from using                      4,823  (_merge==2)

    Matched                               228  (_merge==3)
    -----------------------------------------
(5,051 real changes made)
(4,823 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,986
        from master                     7,070  (_merge==1)
        from using                      4,916  (_merge==2)

    Matched                               220  (_merge==3)
    -----------------------------------------
(5,136 real changes made)
(4,916 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,798
        from master                     7,126  (_merge==1)
        from using                      4,672  (_merge==2)

    Matched                               164  (_merge==3)
    -----------------------------------------
(4,836 real changes made)
(4,672 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,900
        from master                     7,075  (_merge==1)
        from using                      4,825  (_merge==2)

    Matched                               215  (_merge==3)
    -----------------------------------------
(5,040 real changes made)
(4,825 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,253
        from master                     7,231  (_merge==1)
        from using                      5,022  (_merge==2)

    Matched                                59  (_merge==3)
    -----------------------------------------
(5,081 real changes made)
(5,022 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,005
        from master                     7,062  (_merge==1)
        from using                      4,943  (_merge==2)

    Matched                               228  (_merge==3)
    -----------------------------------------
(5,171 real changes made)
(4,943 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,947
        from master                     7,064  (_merge==1)
        from using                      4,883  (_merge==2)

    Matched                               226  (_merge==3)
    -----------------------------------------
(5,109 real changes made)
(4,883 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,168
        from master                     7,174  (_merge==1)
        from using                      4,994  (_merge==2)

    Matched                               116  (_merge==3)
    -----------------------------------------
(5,110 real changes made)
(4,994 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,004
        from master                     7,062  (_merge==1)
        from using                      4,942  (_merge==2)

    Matched                               228  (_merge==3)
    -----------------------------------------
(5,170 real changes made)
(4,942 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,889
        from master                     7,067  (_merge==1)
        from using                      4,822  (_merge==2)

    Matched                               223  (_merge==3)
    -----------------------------------------
(5,045 real changes made)
(4,822 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,191
        from master                     7,188  (_merge==1)
        from using                      5,003  (_merge==2)

    Matched                               102  (_merge==3)
    -----------------------------------------
(5,105 real changes made)
(5,003 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                        12,021
        from master                     7,076  (_merge==1)
        from using                      4,945  (_merge==2)

    Matched                               214  (_merge==3)
    -----------------------------------------
(5,159 real changes made)
(4,945 observations deleted)
r; t=0.69 18:06:01

. 
. * 4.x Final changes
. gen Season = year(Date) - cond(month(Date) < 3, 1, 0)
r; t=0.00 18:06:01

. drop if Season == 2023
(195 observations deleted)
r; t=0.00 18:06:01

. drop Place_Date_Merge 
r; t=0.00 18:06:01

. * 5 Descriptive Statistics *
. 
end of do-file

r; t=4.81 18:06:01
. 
. graph box PM10, by (Place)
option by() not allowed
r(198); t=0.64 18:16:15

. graph box PM10, over(Place)
r; t=1.49 18:16:27

. graph hbox PM10
r; t=1.32 18:16:47

. graph hbox PM10, by(PM10)
--Break--
r(1); t=13.91 18:17:25

. graph hbox PM10, by(Place)
r; t=10.31 18:17:44

. r; t=0.00 18:18:14
r; t=3.77 18:18:18
r; t=3.78 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=0.00 18:18:22
r; t=1.95 18:18:24
r; t=0.00 18:18:24
r; t=0.00 18:18:24
r; t=0.00 18:18:24
r; t=0.00 18:18:25
r; t=0.39 18:18:25
r; t=2.39 18:18:38
r; t=0.00 18:18:38
r; t=0.00 18:18:38
r; t=2.38 18:18:45
r; t=0.00 18:18:45
r; t=0.00 18:18:45
r; t=2.41 18:18:51
r; t=0.00 18:18:51
r; t=0.00 18:18:51
r; t=2.37 18:18:55
r; t=0.00 18:18:55
r; t=0.00 18:18:55
graph box PM10, by(Place, iscale(*0.8))
r; t=10.96 18:19:56

. graph box PM10, by(, title(`"PM10 Concentration per Location"')) by(Place, iscale(*0.8))
r; t=10.77 18:21:50

. r; t=0.00 18:21:59
r; t=3.60 18:22:02
r; t=3.48 18:22:06
r; t=0.00 18:22:06
r; t=0.00 18:22:06
r; t=0.00 18:22:06
r; t=0.00 18:22:06
r; t=0.00 18:22:06
r; t=0.00 18:22:06
r; t=4.39 18:22:10
r; t=0.00 18:22:10
r; t=2.51 18:22:13
r; t=0.00 18:22:13
r; t=0.00 18:22:13
r; t=0.00 18:22:13
graph export "C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\04_Tables\PM10_Concentration_per_Place.pdf", as(pdf) name("Graph")
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\04_Tables\PM10_Concentration_per_Place.pdf saved as PDF format
graph box PM10, by(, title(`"PM10 Concentration per Location"')) scheme(sj) by(Place, iscale(*0.8))
r; t=10.82 18:25:35

. r; t=0.00 18:26:14
r; t=3.64 18:26:18
r; t=3.43 18:26:21
r; t=0.00 18:26:21
r; t=0.00 18:26:21
r; t=0.00 18:26:21
r; t=7.30 18:26:30
r; t=0.00 18:26:30
r; t=2.53 18:26:33
r; t=0.00 18:26:33
r; t=0.00 18:26:33
r; t=0.00 18:26:33
r; t=0.00 18:26:35
r; t=0.00 18:26:35
graph export "C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\04_Tables\PM10_Concentration_per_Place.pdf", as(pdf) name("Graph") replace
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\04_Tables\PM10_Concentration_per_Place.pdf saved as PDF format
graph export "C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\04_Tables\PM10_Concentration_per_Place.png", as(png) name("Graph")
file C:\Users\Fynn\Documents\GitHub\University_Contributions\01_Master\02_Paper\Environmental_Econ_Paper\04_Tables\PM10_Concentration_per_Place.png saved as PNG format
